import React from "react";
import {
  VerticalTimeline,
  VerticalTimelineElement,
} from "react-vertical-timeline-component";
import "react-vertical-timeline-component/style.min.css";
import { FaBirthdayCake, FaChild, FaCrown } from "react-icons/fa";
import { TbPrison, TbStars } from "react-icons/tb";
import { GiDeathSkull } from "react-icons/gi";

const History = () => {
  const timeline = [
    {
      year: "১৯৬৪",
      body: "‘রাসেলের জন্মের আগের মুহূর্তগুলো ছিল ভীষণ উৎকণ্ঠার। আমি, কামাল, জামাল, রেহানা ও খোকা চাচা বাসায়। বড় ফুফু ও মেজো ফুফু মার সাথে। একজন ডাক্তার ও নার্সও এসেছেন। সময় যেন আর কাটে না। জামাল আর রেহানা কিছুক্ষণ ঘুমায় আবার জেগে ওঠে। আমরা ঘুমে ঢুলুঢুলু চোখে জেগে আছি নতুন অতিথির আগমন বার্তা শোনার অপেক্ষায়। মেজো ফুফু ঘর থেকে বের হয়ে এসে খবর দিলেন আমাদের ভাই হয়েছে। খুশিতে আমরা আত্মহারা। কতক্ষণে দেখব। ফুফু বললেন, তিনি ডাকবেন। কিছুক্ষণ পর ডাক এলো। বড় ফুফু আমার কোলে তুলে দিলেন রাসেলকে। মাথাভরা ঘন কালো চুল। তুলতুলে নরম গাল। বেশ বড় সড় হয়েছিল রাসেল।’\nসূত্র: শেখ হাসিনা, ‘আমাদের ছোট রাসেল সোনা’",
      icon: <FaBirthdayCake />,
    },
    {
      year: "১৯৬৬",
      body: "কারাগারে দেখা করার সময় রাসেল কিছুতেই তাঁর বাবাকে রেখে আসবে না। এ কারণে তাঁর মন খারাপ থাকতো। কারাগারের রোজনামচায় ১৯৬৬ সালের ১৫ জুনের দিনলিপিতে রাসেলকে নিয়ে বঙ্গবন্ধু লিখেছেন, “১৮ মাসের রাসেল জেল অফিসে এসে একটুও হাসে না- যে পর্যন্ত আমাকে না দেখে। দেখলাম দূর থেকে পূর্বের মতোই ‘আব্বা আব্বা’ বলে চিৎকার করছে। জেল গেট দিয়ে একটা মাল বোঝাই ট্রাক ঢুকেছিল। আমি তাই জানালায় দাঁড়াইয়া ওকে আদর করলাম। একটু পরেই ভিতরে যেতেই রাসেল আমার গলা ধরে হেসে দিল। ওরা বলল আমি না আসা পর্যন্ত শুধু জানালার দিকে চেয়ে থাকে, বলে ‘আব্বার বাড়ি’। এখন ধারণা হয়েছে এটা ওর আব্বার বাড়ি। যাবার সময় হলে ওকে ফাঁকি দিতে হয়।”",
      icon: <TbPrison />,
    },
    {
      year: "১৯৬৭",
      body: "কারগারের রোজনামচায় ১৯৬৭ সালের ১৪-১৫ এপ্রিলের অন্যান্য প্রসঙ্গ ছাড়াও রাসেলকে নিয়ে বঙ্গবন্ধু লিখেছেন, “জেল গেটে যখন উপস্থিত হলাম ছোট ছেলেটা আজ আর বাইরে এসে দাঁড়াইয়া নাই দেখে আশ্চর্যই হলাম। আমি যখন রুমের ভিতর যেয়ে ওকে কোলে করলাম আমার গলা ধরে ‘আব্বা’ ‘আব্বা’ করে কয়েকবার ডাক দিয়ে ওর মার কোলে যেয়ে ‘আব্বা’ ‘আব্বা’ করে ডাকতে শুরু করল। ওর মাকে ‘আব্বা’ বলে। আমি জিজ্ঞাসা করলাম, ‘ব্যাপার কি?’ ওর মা বলল,“বাড়িতে ‘আব্বা’ ‘আব্বা’ করে কাঁদে তাই ওকে বলেছি আমাকে ‘আব্বা’ বলে ডাকতে।” রাসেল ‘আব্বা’ ‘আব্বা’ বলে ডাকতে লাগল। যেই আমি জবাব দেই সেই ওর মার গলা ধরে বলে, ‘তুমি আমার আব্বা।’ আমার উপর অভিমান করেছে বলে মনে হয়। এখন আর বিদায়ের সময় আমাকে নিয়ে যেতে চায় না।”",
      icon: <FaChild />,
    },
    {
      year: "১৯৭১",
      body: "১৯৭১ সালে রাসেল তাঁর মা ও দুই আপাসহ পরিবারের সদস্যদের সঙ্গে ধানমণ্ডি ১৮ নম্বর সড়কের একটি বাড়িতে বন্দি জীবন কাটিয়েছেন। পিতা বঙ্গবন্ধু তখন পাকিস্তানের কারাগারে বন্দি এবং বড় দুই ভাই শেখ কামাল ও শেখ জামাল চলে গেছেন মুক্তিযুদ্ধে। মা ও আপাসহ পরিবারের সদস্যরা ১৯৭১ সালের ১৭ই ডিসেম্বর মুক্ত হন। রাসেল ‘জয় বাংলা’ বলে ঘর থেকে বেরিয়ে আসেন। বাইরে তখন চলছে বিজয়-উৎসব।",
      icon: <FaCrown />,
    },
    {
      year: "১৯৭৫",
      body: "১৯৭৫ সালের ১৫ আগস্ট কালরাতে দেশি-বিদেশি চক্রান্তে পরিবারের সদস্যদের সাথে শেখ রাসেলকেও হত্যা করা হয়। তখন রাসেল ইউনিভার্সিটি ল্যাবরেটরি স্কুলের চতুর্থ শ্রেণির ছাত্র।",
      icon: <GiDeathSkull />,
    },
  ];

  return (
    <>
      <div className="bg-gray-100" id="history">
        <VerticalTimeline>
          {timeline.map((e, i) => {
            return (
              <VerticalTimelineElement
                className="vertical-timeline-element--work"
                date={e.year}
                iconStyle={{
                  background:
                    i % 2 === 1 ? "rgb(33, 150, 243)" : "rgb(233, 30, 99)",
                  color: "#fff",
                }}
                key={i}
                icon={e.icon}
              >
                <h1>{e.body}</h1>
              </VerticalTimelineElement>
            );
          })}
          <VerticalTimelineElement
            iconStyle={{ background: "rgb(16, 204, 82)", color: "#fff" }}
            icon={<TbStars />}
          />
        </VerticalTimeline>
      </div>
    </>
  );
};

export default History;
